** Download 16.04 mini.iso
Download a trusty mini.iso and check if the download went well
#+BEGIN_SRC sh :shebang "#!/bin/bash" :tangle iso-creation.sh
ubunturelease="xenial"
wget --quiet 'http://archive.ubuntu.com/ubuntu/dists/'"$ubunturelease"'/main/installer-amd64/current/images/netboot/mini.iso'
wget --quiet -O - 'http://archive.ubuntu.com/ubuntu/dists/'"$ubunturelease"'/main/installer-amd64/current/images/MD5SUMS' | grep "netboot/mini.iso" | sed 's/netboot\///g' > MD5SUMS
md5sum -c MD5SUMS
#+END_SRC

#+results:
: ./mini.iso: OK

